package projectteam1;

// 게임 로직(실행 메소드 모음)
public class MouseRoadLogic {

	// 시작버튼 클릭시 게임맵의 검은화면이 벗겨짐
	
	// 시작버튼 클릭시 타이머 작동
	
	// 시작버튼 클릭시 마우스감지
	
	
	
	// 게임 클리어 조건 - 시간이 0이 아닌경우 도착버튼을 누르면 클리어
	
	// 게임클리어 후 종료버튼 클릭시 팝업으로 클리어축하 메시지보여줌

	// 게임클리어 후 종료버튼 클릭시 이전 남은 시간들과 비교하여 랭킹이 자동으로 갱신됨
	// 등수 Ranking thread 이용

	// 게임클리어 후 종료버튼 클릭시 타이머가 멈춤
	
	// 게임클리어 후 종료버튼 클릭시 맵의 검은화면이 맵을 가림 
	
	// 게임클리어 후 종료버튼 클릭시 마우스감지 해제
	
	
	// 게임오버인 경우 1 - block에 닿음
	// 게임오버인 경우 2 - 맵을 벗어남
	// 게임오버인 경우 3 - 시간초과

	

}
